# Handling Categorical Features

## One Hot Encoding

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df=pd.read_csv('train.csv',usecols=['Sex'])

In [3]:
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [4]:
pd.get_dummies(df,drop_first=True).head()

   Sex_male
0         1
1         0
2         0
3         0
4         1

In [5]:
df

        Sex
0      male
1    female
2    female
3    female
4      male
..      ...
886    male
887  female
888  female
889    male
890    male

[891 rows x 1 columns]

In [6]:
df=pd.read_csv('train.csv',usecols=['Embarked'])

In [7]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [9]:
df.dropna(inplace=True)

In [10]:
pd.get_dummies(df,drop_first=True).head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1

# Ordinal Number Encoding

In [11]:
import datetime

In [12]:
today_date=datetime.datetime.today()

In [13]:
today_date

datetime.datetime(2022, 7, 15, 18, 1, 0, 825349)

In [14]:
today_date-datetime.timedelta(3)

datetime.datetime(2022, 7, 12, 18, 1, 0, 825349)

In [15]:
days=[today_date-datetime.timedelta(x) for x in range(0,15)]

In [16]:
import pandas as pd
data=pd.DataFrame(days)
data.columns=["Day"]

In [18]:
data

                          Day
0  2022-07-15 18:01:00.825349
1  2022-07-14 18:01:00.825349
2  2022-07-13 18:01:00.825349
3  2022-07-12 18:01:00.825349
4  2022-07-11 18:01:00.825349
5  2022-07-10 18:01:00.825349
6  2022-07-09 18:01:00.825349
7  2022-07-08 18:01:00.825349
8  2022-07-07 18:01:00.825349
9  2022-07-06 18:01:00.825349
10 2022-07-05 18:01:00.825349
11 2022-07-04 18:01:00.825349
12 2022-07-03 18:01:00.825349
13 2022-07-02 18:01:00.825349
14 2022-07-01 18:01:00.825349

In [24]:
data['Weekday'] = data['Day'].dt.day_name()

In [25]:
data.head()

                         Day    Weekday
0 2022-07-15 18:01:00.825349     Friday
1 2022-07-14 18:01:00.825349   Thursday
2 2022-07-13 18:01:00.825349  Wednesday
3 2022-07-12 18:01:00.825349    Tuesday
4 2022-07-11 18:01:00.825349     Monday

In [26]:
dictionary={'Monday':1,'Tuesday':2,'Wednesday':3,'Thursday':4,'Friday':5,'Saturday':6,'Sunday':7}

In [27]:
dictionary

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [28]:
data['weekday_ordinal']=data['Weekday'].map(dictionary)

In [30]:
data

                          Day    Weekday  weekday_ordinal
0  2022-07-15 18:01:00.825349     Friday                5
1  2022-07-14 18:01:00.825349   Thursday                4
2  2022-07-13 18:01:00.825349  Wednesday                3
3  2022-07-12 18:01:00.825349    Tuesday                2
4  2022-07-11 18:01:00.825349     Monday                1
5  2022-07-10 18:01:00.825349     Sunday                7
6  2022-07-09 18:01:00.825349   Saturday                6
7  2022-07-08 18:01:00.825349     Friday                5
8  2022-07-07 18:01:00.825349   Thursday                4
9  2022-07-06 18:01:00.825349  Wednesday                3
10 2022-07-05 18:01:00.825349    Tuesday                2
11 2022-07-04 18:01:00.825349     Monday                1
12 2022-07-03 18:01:00.825349     Sunday                7
13 2022-07-02 18:01:00.825349   Saturday                6
14 2022-07-01 18:01:00.825349     Friday                5

# Count or Frequency Encoding

In [31]:
df = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None)
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [32]:
columns=[1,3,5,6,7,8,9,13]

In [33]:
df=df[columns]

In [34]:
df.columns=['Employment','Degree','Status','Designation','family_job','Race','Sex','Country']

In [35]:
df.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [36]:
for feature in df.columns[:]:
    print(feature,":",len(df[feature].unique()),'labels')

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [37]:
country_map=df['Country'].value_counts().to_dict()

In [38]:
df['Country']=df['Country'].map(country_map)
df.head(20)

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95
5,Private,Masters,Married-civ-spouse,Exec-managerial,Wife,White,Female,29170
6,Private,9th,Married-spouse-absent,Other-service,Not-in-family,Black,Female,81
7,Self-emp-not-inc,HS-grad,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
8,Private,Masters,Never-married,Prof-specialty,Not-in-family,White,Female,29170
9,Private,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
10,Private,Some-college,Married-civ-spouse,Exec-managerial,Husband,Black,Male,29170
11,State-gov,Bachelors,Married-civ-spouse,Prof-specialty,Husband,Asian-Pac-Islander,Male,100
12,Private,Bachelors,Never-married,Adm-clerical,Own-child,White,Female,29170
13,Private,Assoc-acdm,Never-married,Sales,Not-in-family,Black,Male,29170
14,Private,Assoc-voc,Married-civ-spouse,Craft-repair,Husband,Asian-Pac-Islander,Male,583
15,Private,7th-8th,Married-civ-spouse,Transport-moving,Husband,Amer-Indian-Eskimo,Male,643
16,Self-emp-not-inc,HS-grad,Never-married,Farming-fishing,Own-child,White,Male,29170
17,Private,HS-grad,Never-married,Machine-op-inspct,Unmarried,White,Male,29170
18,Private,11th,Married-civ-spouse,Sales,Husband,White,Male,29170
19,Self-emp-not-inc,Masters,Divorced,Exec-managerial,Unmarried,White,Female,29170

## Advantages
1. Easy To Use
2. Not increasing feature space

## Disadvantages
1. It will provide same weight if the frequencies are same

# Target Guided Ordinal Encoding
1. Ordering the labels according to the target
2. Replace the labels by the joint probability of being 1 or 0

In [39]:
import pandas as pd
df=pd.read_csv('train.csv', usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [40]:
df['Cabin'].fillna('Missing',inplace=True)

In [41]:
df['Cabin']=df['Cabin'].astype(str).str[0]

In [42]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [43]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [44]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [45]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [46]:
ordinal_labels=df.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [47]:
enumerate(ordinal_labels,0)

In [48]:
ordinal_labels2={k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_labels2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [49]:
df['Cabin_ordinal_labels']=df['Cabin'].map(ordinal_labels2)
df.head()

   Survived Cabin  Cabin_ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

# Mean Encoding

In [50]:
mean_ordinal=df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [51]:
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [52]:
df['mean_ordinal_encode']=df['Cabin'].map(mean_ordinal)
df.head()

   Survived Cabin  Cabin_ordinal_labels  mean_ordinal_encode
0         0     M                     1             0.299854
1         1     C                     4             0.593220
2         1     M                     1             0.299854
3         1     C                     4             0.593220
4         0     M                     1             0.299854